In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('/Users/mariyakhan/Desktop/Ecomm/ecommerce_transactions.csv' , encoding_errors='ignore')

In [4]:
df.head()

,Transaction_ID,User_Name,Age,Country,Product_Category,Purchase_Amount,Payment_Method,Transaction_Date
0,1,Ava Hall,63,Mexico,Clothing,780.69,Debit Card,2023-04-14
1,2,Sophia Hall,59,India,Beauty,738.56,PayPal,2023-07-30
2,3,Elijah Thompson,26,France,Books,178.34,Credit Card,2023-09-17
3,4,Elijah White,43,Mexico,Sports,401.09,UPI,2023-06-21
4,5,Ava Harris,48,Germany,Beauty,594.83,Net Banking,2024-10-29

In [5]:
df.describe()

       Transaction_ID           Age  Purchase_Amount
count    50000.000000  50000.000000     50000.000000
mean     25000.500000     43.968680       503.159793
std      14433.901067     15.260578       286.563558
min          1.000000     18.000000         5.040000
25%      12500.750000     31.000000       255.450000
50%      25000.500000     44.000000       503.110000
75%      37500.250000     57.000000       751.162500
max      50000.000000     70.000000       999.980000

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction_ID    50000 non-null  int64
 1   User_Name         50000 non-null  object
 2   Age               50000 non-null  int64
 3   Country           50000 non-null  object
 4   Product_Category  50000 non-null  object
 5   Purchase_Amount   50000 non-null  float64
 6   Payment_Method    50000 non-null  object
 7   Transaction_Date  50000 non-null  object
dtypes: float64(1), int64(2), object(5)
memory usage: 3.1+ MB

In [7]:
df.duplicated().sum()

np.int64(0)

In [8]:
df.isnull().sum()

Transaction_ID      0
User_Name           0
Age                 0
Country             0
Product_Category    0
Purchase_Amount     0
Payment_Method      0
Transaction_Date    0
dtype: int64

In [9]:
df.dtypes

Transaction_ID        int64
User_Name            object
Age                   int64
Country              object
Product_Category     object
Purchase_Amount     float64
Payment_Method       object
Transaction_Date     object
dtype: object

In [10]:
df['Purchase_Amount'] = df['Purchase_Amount'].astype(float)

In [11]:
df.dtypes

Transaction_ID        int64
User_Name            object
Age                   int64
Country              object
Product_Category     object
Purchase_Amount     float64
Payment_Method       object
Transaction_Date     object
dtype: object

In [12]:
df.head()

,Transaction_ID,User_Name,Age,Country,Product_Category,Purchase_Amount,Payment_Method,Transaction_Date
0,1,Ava Hall,63,Mexico,Clothing,780.69,Debit Card,2023-04-14
1,2,Sophia Hall,59,India,Beauty,738.56,PayPal,2023-07-30
2,3,Elijah Thompson,26,France,Books,178.34,Credit Card,2023-09-17
3,4,Elijah White,43,Mexico,Sports,401.09,UPI,2023-06-21
4,5,Ava Harris,48,Germany,Beauty,594.83,Net Banking,2024-10-29

In [13]:
df.columns

Index(['Transaction_ID', 'User_Name', 'Age', 'Country', 'Product_Category',
       'Purchase_Amount', 'Payment_Method', 'Transaction_Date'],
      dtype='object')

In [14]:
df['Transaction_Date'] = pd.to_datetime(df['Transaction_Date'], format='%Y-%m-%d')

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction_ID    50000 non-null  int64
 1   User_Name         50000 non-null  object
 2   Age               50000 non-null  int64
 3   Country           50000 non-null  object
 4   Product_Category  50000 non-null  object
 5   Purchase_Amount   50000 non-null  float64
 6   Payment_Method    50000 non-null  object
 7   Transaction_Date  50000 non-null  datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(2), object(4)
memory usage: 3.1+ MB

In [16]:
df['Transaction_ID'] = df['Transaction_ID'].astype(int)

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction_ID    50000 non-null  int64
 1   User_Name         50000 non-null  object
 2   Age               50000 non-null  int64
 3   Country           50000 non-null  object
 4   Product_Category  50000 non-null  object
 5   Purchase_Amount   50000 non-null  float64
 6   Payment_Method    50000 non-null  object
 7   Transaction_Date  50000 non-null  datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(2), object(4)
memory usage: 3.1+ MB

In [18]:
df.to_csv('/Users/mariyakhan/Desktop/Ecomm/cleaned_ecommerce_transactions.csv', index=False)

In [19]:
import psycopg2

In [20]:
from sqlalchemy import create_engine

In [21]:
engine_psql = create_engine("postgresql+psycopg2://postgres:root@localhost:5432/Ecommerce")

try:
    engine_psql
    print("connection successful")
except:
    print("Unable to connect")

connection successful

In [22]:
df.to_sql(name='sales' , con=engine_psql, if_exists='append' , index=False)

1000